//一只青蛙一次可以跳上1级台阶，也可以跳上2级台阶。求该青蛙跳上一个 n 级的台阶总共有多少种跳法。
// 答案需要取模 1e9+7（1000000007），如计算初始结果为：1000000008，请返回 1。
// 输入：n = 3
// 输出：3
// 输入：n = 2
// 输出：2
// 输入：n = 1
// 输出：1
// 输入：n = 0
// 输出：1
// 当fn>1时
// f(n) = f(n-1)+f(n-2)
// f(1) = 1,f(0) = 1
function getNum(num) {
    if (num <= 1) {
        return 1;
    }
    let arr = [];
    arr[0] = 1;
    arr[1] = 1;
    for (let i = 2; i <= num; i++) {
        arr[i] = arr[i - 1] + arr[i - 2] % 1000000007;
    }
    return arr[num]
}

console.log(getNum(4))
